tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Generic library support script
brew "libtool"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# OpenGL Extension Wrangler Library
brew "glew"
# OpenGL and OpenGL ES reference compiler for shading languages
brew "glslang"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Interactive computing in Python
brew "ipython"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Macro processing language
brew "m4"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Small build system for use with gyp or CMake
brew "ninja"
# Manage multiple Node.js versions
brew "nvm"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup-init"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Multi-media library with bindings for multiple languages
brew "sfml"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "background-music"
# Mobile gaming platform
cask "bluestacks"
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Legacy runtime for the Java programming language
cask "java6"
# Collaboration platform for API development
cask "postman"
# Integrated development environment
cask "visual-studio-code-insiders"
